{
    "version": "https://jsonfeed.org/version/1",
    "title": "trektravelgithubio",
    "description": "",
    "home_page_url": "https://trektravel.github.io",
    "feed_url": "https://trektravel.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "trektravel"
    },
    "items": [
        {
            "id": "https://trektravel.github.io/top-10-treks-to-consider-while-trekking-in-india.html",
            "url": "https://trektravel.github.io/top-10-treks-to-consider-while-trekking-in-india.html",
            "title": "Top 6 treks to consider while trekking in India",
            "content_html": "<p>This is a list of the top 5 treks I think one should do in the Indian Himalayas.&nbsp;</p>\n<p>I consider myself an average trekker and I have prepared this list for other trekkers like me!&nbsp;</p>\n<p>Given the vastness of the himalayas and the diversity in the region, every trek has something special. So this list is not based on popularity of a trek instead is based on the following parameters.</p>\n<ul>\n<li>Should have great views (Isn't this an obvious parameter :)</li>\n<li>The views should change frequently. Everyone loves pleasant surprises :)</li>\n<li>Should not be too remote!</li>\n</ul>\n<p>1. The Valley Of Flowers, Uttarakhand</p>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/vof.jpg\" alt=\"Valley Of Flowers\" width=\"1080\" height=\"1080\"></p>\n<p>The Valley of Flowers trek in Uttarakhand takes you through one of the most&nbsp;picturesque valley in the Western Himalayas. Other than the vast varieties of flowers, the valley is also home to some rare and endangered animal species. In this trek you could spot animals like the red fox, blue sheep, brown bear and many more. The floral pastures in the backdrop of the mighty himalayas makes this trek a trip to remember. The Valley of Flowers is&nbsp;covered with a thick blanket of snow during the winter season. The best time to trek the Valley of flowes is in the months of July, August and September when the valley would be in full bloom. The trek would be graded as an easy trek.</p>\n<p>&nbsp;</p>\n<p>2. The Hampta Pass Trek, Himachal Pradesh</p>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/img_20170727_112535692.jpg\" alt=\"Hampta Pass\" width=\"4032\" height=\"2268\"></p>\n<p>The Hampta Pass trek starts in Manali and ends in Spiti. This is a fantastic trek from&nbsp;the views we get in&nbsp;the Valley in Manali to the Views we get in the Spiti Valley. In the Manali Valley, you will see lush green grass and big rocks and the river flowing with full rage. On the other side of the valley, the vastness of the mountains become very evident, the tall trees dissapear clearing the view to the horizon which seems endless. The green grass turns yellowish and even the river seems a little subdued in the presence of the huge mountains. &nbsp;I would consider this trek to be of moderate difficulty, well maybe a little more difficult than just moderate! Cause the pas itself is above 4000 meters! The best time to do this trek is between June to October.&nbsp;</p>\n<p>3. The Roopkund Trek, Uttarakhand</p>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/roopkund.jpg\" alt=\"\" width=\"1080\" height=\"967\"></p>\n<p>The roopkund trek is one of the famous treks in the himalayan region for the skeletons found near the roopkund lake. But there is much more to this trek than just the mysterious skeletons. The trek starts from the beautiful Wan village, passes through dense forests to reach the vast open and endless meadows of Ali and Bedni Bugyal. To reach the lake, a trekker would have to navigate through snow, which is an exciting propsect but&nbsp;needs to be done carefully. It is best to take a local guide for this trek. On this trek you could mesmerising views of Mount Trishul and other majetic ranges in the himalayas. It is a trek not to be missed! &nbsp;The trek is no doubt a a difficult one possibly bordering on moderate difficulty for very experienced trekkers. The best time to do the roopkund&nbsp;trek would be from Late May to June and then from September to October. There are quiet a few roopkund trek packages from local guides on sherpafeet.</p>\n<p>4. The Kuari Pass Trek, Uttarakhand</p>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/kuaripass.jpg\" alt=\"Kuari Pass Trek\" width=\"640\" height=\"640\"></p>\n<p>The Kuari Pass Trek, also called Lord Curzons trail is a trek which one should not miss at any cost. The trek can be done in the summer and in the winter too. In the Winter the Kuari Pass trek is amazing, not that it isn't amazing in Summers. Yet there aren't many treks in the himalayas which are possible in the Winters. &nbsp;On this trek you would pass through dense oak forests cross vast fields of snow and at night view the moonlight reflected off the snow loaden white forests. Makes an amazing experience, throw in a bonfire and friends and there could be nothing better :)</p>\n<p>5. The Great Lakes Trek, Jammu and Kashmir</p>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/kgl.jpg\" alt=\"\" width=\"1080\" height=\"714\"><br><br>This lake is rightfully considered one of the most beautiful treks, on this trek you can see seven lakes. These lakes originate from galciers. Each lake has a charm of its own. Viewing these lakes nestled beautifully in the valley is an amaznig experience. On the treks you will see pristine white river streams, wonderful birch forests, beautiful meadows and when you bring all of this together it is nothing less than heavenly. The lake would be considered a moderately difficult trek. The best time to do this trek would be from the end of May to June and from the middle of september to about the middle of october. From July to September is the monsoons in the region.<br><br>&nbsp;</p>",
            "image": "https://trektravel.github.io/media/posts/1/roopkund.jpg",
            "author": {
                "name": "trektravel"
            },
            "tags": [
            ],
            "date_published": "2017-10-24T12:33:57+05:30",
            "date_modified": "2017-10-24T12:33:49+05:30"
        }
    ]
}
