{
    "version": "https://jsonfeed.org/version/1",
    "title": "trekking-in-india-himalayas",
    "description": "",
    "home_page_url": "https://trektravel.github.io",
    "feed_url": "https://trektravel.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "trektravel"
    },
    "items": [
        {
            "id": "https://trektravel.github.io/kuari-pass-trek-blog-and-pangarchulla-peak-summit.html",
            "url": "https://trektravel.github.io/kuari-pass-trek-blog-and-pangarchulla-peak-summit.html",
            "title": "Kuari Pass Trek Blog &amp; Pangarchulla Peak Summit",
            "content_html": "<p>Kuari Pass is considered an easy trek. But what is easy for some may not necessarily be easy for others. Such is the case with me. A trek which takes you to an altitude of above 15000 ft could be a cake walk for some, but for me to reach this altitude was about rediscovering myself! I do not think it is always about pushing oneself beyond ones limits I rather think it is about going beyond a comfort zone.&nbsp; There is a difference between the two. Pushing oneself beyond ones physical limits could in the literal sense of the word be a dangerous thing. This is especially so at high altitudes where the oxygen gets thin. On the other hand to be able to sense ones comfort zone and go beyond it helps us open our eyes to possibilities which we never thought possible!</p>\n<p><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/19367741_234102657107840_5113298938304135168_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"746\"><br><br><br>To be able to successfully complete an Himalayan trek, totally depends on oneself. We do make our friendships deeper and possibly more friends for life on the way though! This trek was a great learning experiences for me as I learnt to trust myself. We started of as a group, but slowly I got left behind. We had booked the trek with a local business who were very helpful yet at the end of the day it is the personal confidence which we have on ourselves which lets us complete the trek.<br><br><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/21227515_155396971709169_563861577409757184_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"959\"><br><br><br>Me and my friends had been wanting to do the Kuari Pass Trek from a long time. We wanted to do the trek with a local business or local guide who could also tell us about their culture and maybe a little bit the history of the region. What I love about trekking is it allows us to hangout with nature and people simultaneously, I enjoy the long conversations on treks about life and love.&nbsp; It is a great ice breaker with trekkers who had been strangers a few hours back! Thats what I love about treks, every trek leaves me with new impressions of the mountains and the people. The conversations and the dreams behind them, let loose in the vast himalayan space which seems limitless.</p>\n<p><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/21371869_363251350772379_4793269582070546432_n.jpg\" alt=\"Kuari Pass Trek\" width=\"780\" height=\"720\"><br><br><br><br>I have never made friends in the city, my work place colleagues are just colleagues. But I did make friends on this 5 day trek with the trekkers who shared my moments of fear and success. Trekkers who enjoy thrills just like I do, and they are here for the same reason I am, to enjoy the pristine mountain beauty and some hard walking!<br><br><br><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/22277447_2026569307574539_1771297903608856576_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"637\"><br><br>It took us three days to reach the beautiful base camp of Tali. We had trekked from Auli and passed through Gorson Bugyals. We spent the night in Tali and after which we trekker to Khulara, which is the base camp for the Kuari Pass Trek. All the time we had magnificent views of the mountains around us. We could see the Majestic Nanda Devi, Dronagiri, Hathi Parbat and others. Our camping spot in Khulara was near perfect. We had a water stream close to our camp and the majestic mountains as our backdrop.<br><br><br><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/17437629_1850746931872434_6928375731323928576_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"607\"><br><br>Our next destination was to summit the Pangarchulla Peak. Our guides instructed us that we should start the trek very early in the morning by about 3:30 am to do this. The trek to Pangarchulla was going to be hard and would test our grit, determination and fitness! We had enjoyed the last three days of the trek and were still full of enthusiasm for the adventure ahead of us.&nbsp; Our plan was to reach the peak by sunrise, so we are able to see the awesome visual delight it is supposed to be.<br><br>Early morning all of us got ready in time and we started our trek towards the peak, all of us closely tailed our guides, we also had a few mountain dogs keep us company! It was a beautiful cold night, there was absolutely no wind and the stars shined right above us on a clear night sky bereft of clouds.<br><br><br>We were going to climb to the highest altitude of our trek and the oxygen was already getting pretty thin, we could feel it. Our guides were alert to our groups needs especially at such a high altitudes when we are vulnerable to AMS (Altitude Mountain Sickness). Our guides had told us previously that they have the right to turn back anyone if they felt the trekker is not well and we all have to listen to them come what may.&nbsp; A few members of the group had headaches and nausea and our guides handled them well, the trekkers who were unwell slowed our progress but luckily none had to return.<br><br><br><br><br>It was a terrific climb to the Panagarchulla peak, we could see the sun play its games with the himalayan peaks, as it progressively lights one peak after another in a sequential manner. As the sun lit up the area we could gradually start seeing the wide green meadows with patches of snow. The vast himalayan ranges opened up far ahead in front of us and closer to us where the freshly bloomed white, red and pink Rhododendrons scattered in a playfully random way. It was a beautiful sight.<br><br><br><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/17437629_1850746931872434_6928375731323928576_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"607\"><br><br>Our climb to Pangarchulla Peak was not easy at all, every step was to be taken cautiously and it was tiring. When I started out in the morning we were full of energy and enthusiasm now I was pretty much exhausted of my energy but nothing could take away my enthusiasm. The steep climb to the peak wasn&rsquo;t making it easier in any way! On reaching the top, I would be lying if I said, there were no tears in my eyes.<br><br>We relaxed on the top for some time enjoying the view around and happily satisfied with our efforts to be able to make it till here! Going down would be easy is what we felt. Sliping and sliding down the snow slopes!<br><br></p>\n<p><img class=\"post__image--center\" src=\"https://trektravel.github.io/media/posts/3/17931883_1341763065889725_7027713102200176640_n.jpg\" alt=\"Kuari Pass Trek\" width=\"1080\" height=\"859\"></p>\n<p><br>There is a saying never to underestimate anything. The trek down was way more trickier, the snow had started to melt and things were getting slippery. Thats when I remembered from the dozens of mountaineering books I had read, most of the tragedies occurred on the way down. It was a glum thought on an otherwise upbeat day! Thanks to our wonderful guides who helped me navigate the slippery trek downhill, they let us slide at places which they considered safe.<br><br>We finally reached our base camp at dusk it was a tough day with many misses and a whole lot of memories I will cherish for a life time!</p>",
            "image": "https://trektravel.github.io/media/posts/3/kuaripass.jpg",
            "author": {
                "name": "trektravel"
            },
            "tags": [
                   "Kuari-Pass"
            ],
            "date_published": "2017-10-24T14:46:52+05:30",
            "date_modified": "2017-10-24T14:46:42+05:30"
        },
        {
            "id": "https://trektravel.github.io/top-10-treks-to-consider-while-trekking-in-india.html",
            "url": "https://trektravel.github.io/top-10-treks-to-consider-while-trekking-in-india.html",
            "title": "Top 5 treks to consider while trekking in India",
            "content_html": "<p><strong><em>This is a list of the top 5 treks I think one should do in the Indian Himalayas.&nbsp;</em></strong></p>\n<p>I consider myself an average trekker and I have prepared this list for other trekkers like me!&nbsp;</p>\n<p>Given the vastness of the himalayas and the diversity in the region, every trek has something special. So this list is not based on popularity of a trek instead is based on the following parameters.</p>\n<ul>\n<li>Should have great views (Isn't this an obvious parameter :)</li>\n<li>The views should change frequently. Everyone loves pleasant surprises :)</li>\n<li>Should not be too remote!</li>\n</ul>\n<h2>1. The Valley Of Flowers, Uttarakhand</h2>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/vof.jpg\" alt=\"Valley Of Flowers\" width=\"1080\" height=\"1080\"></p>\n<p>The Valley of Flowers trek in Uttarakhand takes you through one of the most&nbsp;picturesque valley in the Western Himalayas. Other than the vast varieties of flowers, the valley is also home to some rare and endangered animal species. In this trek you could spot animals like the red fox, blue sheep, brown bear and many more. The floral pastures in the backdrop of the mighty himalayas makes this trek a trip to remember. The Valley of Flowers is&nbsp;covered with a thick blanket of snow during the winter season. The best time to trek the Valley of flowes is in the months of July, August and September when the valley would be in full bloom. The trek would be graded as an easy trek.</p>\n<p>&nbsp;</p>\n<h2>2. The Hampta Pass Trek, Himachal Pradesh</h2>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/img_20170727_112535692.jpg\" alt=\"Hampta Pass\" width=\"4032\" height=\"2268\"></p>\n<p>The Hampta Pass trek starts in Manali and ends in Spiti. This is a fantastic trek from&nbsp;the views we get in&nbsp;the Valley in Manali to the Views we get in the Spiti Valley. In the Manali Valley, you will see lush green grass and big rocks and the river flowing with full rage. On the other side of the valley, the vastness of the mountains become very evident, the tall trees dissapear clearing the view to the horizon which seems endless. The green grass turns yellowish and even the river seems a little subdued in the presence of the huge mountains. &nbsp;I would consider this trek to be of moderate difficulty, well maybe a little more difficult than just moderate! Cause the pas itself is above 4000 meters! The best time to do this trek is between June to October.&nbsp;</p>\n<h2>3. The Roopkund Trek, Uttarakhand</h2>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/roopkund.jpg\" alt=\"\" width=\"1080\" height=\"967\"></p>\n<p>The roopkund trek is one of the famous treks in the himalayan region for the skeletons found near the roopkund lake. But there is much more to this trek than just the mysterious skeletons. The trek starts from the beautiful Wan village, passes through dense forests to reach the vast open and endless meadows of Ali and Bedni Bugyal. To reach the lake, a trekker would have to navigate through snow, which is an exciting propsect but&nbsp;needs to be done carefully. It is best to take a local guide for this trek. On this trek you could mesmerising views of Mount Trishul and other majetic ranges in the himalayas. It is a trek not to be missed! &nbsp;The trek is no doubt a a difficult one possibly bordering on moderate difficulty for very experienced trekkers. The best time to do the roopkund&nbsp;trek would be from Late May to June and then from September to October. There are quiet a few roopkund trek packages from local guides on sherpafeet.</p>\n<h2>4. The Kuari Pass Trek, Uttarakhand</h2>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/kuaripass.jpg\" alt=\"Kuari Pass Trek\" width=\"640\" height=\"640\"></p>\n<p>The Kuari Pass Trek, also called Lord Curzons trail is a trek which one should not miss at any cost. The trek can be done in the summer and in the winter too. In the Winter the Kuari Pass trek is amazing, not that it isn't amazing in Summers. Yet there aren't many treks in the himalayas which are possible in the Winters. &nbsp;On this trek you would pass through dense oak forests cross vast fields of snow and at night view the moonlight reflected off the snow loaden white forests. Makes an amazing experience, throw in a bonfire and friends and there could be nothing better :)</p>\n<h2>5. The Great Lakes Trek, Jammu and Kashmir</h2>\n<p><img class=\"post__image--wide\" src=\"https://trektravel.github.io/media/posts/1/kgl.jpg\" alt=\"\" width=\"1080\" height=\"714\"><br><br>This lake is rightfully considered one of the most beautiful treks, on this trek you can see seven lakes. These lakes originate from galciers. Each lake has a charm of its own. Viewing these lakes nestled beautifully in the valley is an amaznig experience. On the treks you will see pristine white river streams, wonderful birch forests, beautiful meadows and when you bring all of this together it is nothing less than heavenly. The lake would be considered a moderately difficult trek. The best time to do this trek would be from the end of May to June and from the middle of september to about the middle of october. From July to September is the monsoons in the region.<br><br>&nbsp;</p>",
            "image": "https://trektravel.github.io/media/posts/1/roopkund.jpg",
            "author": {
                "name": "trektravel"
            },
            "tags": [
                   "Valley-Of-Flowers",
                   "Roopkund",
                   "Kuari-Pass",
                   "Kashmir-Great-Lakes",
                   "Hampta-Pass"
            ],
            "date_published": "2017-10-24T14:46:52+05:30",
            "date_modified": "2017-10-24T13:18:41+05:30"
        }
    ]
}
